export const MOCKED_FAQ_DATA = [
    {
        id: 1,
        question: 'Який інвентар потрібен для тренувань?',
        answer: 'Всі вправи націлені на навантаження із використанням власної ваги. Вам знадобиться лише: килимок, 2 йога блоки та для більшого відчуття м‘язів - резинки або гантелі.',
    },
    {
        id: 2,
        question: 'Чи підійдуть тренування для початківців або любителів?',
        answer: 'Програми тренувань розраховані на різні рівні фізичної підготовки.',
    },
    {
        id: 3,
        question: 'Скільки тривають тренування?',
        answer: 'Тривалість тренування 40-50 хв.',
    },
    {
        id: 4,
        question: 'Які є протипоказання до проходження курсу?',
        answer: 'Проблеми зі здоров‘ям, якісь травми, грижі в стані запалення, варикоз,запальні процеси. Обов‘язково проконсультуйтеся з лікарем.',
    },
    {
        id: 5,
        question: 'Коли я досягну бажаного результату?',
        answer: 'Результат залежить від еластичності м‘язів,суглобів, також від регулярності тренувань і вашої індивідуальності. Велику роль відіграє харчування в процессі схуднення меню харчування.',
    },
];
